Repository: SilviuCPopa/shopping-list-flutter
Catalog: lib/l10n/app_*.arb
Languages: ro

source: Settings
ro: Setari

source: Language
ro: Limba

source: Currency
ro: Moneda

source: Delete
ro: Sterge

source: Rename
ro: Redenumeste

source: Cancel
ro: Anuleaza

source: Confirm
ro: Confirmati

source: Items
ro: Produse

source: Quantity
ro: Cantitate

source: Enter name
ro: Introduceti numele

# marksAsBought
source: Mark as bought
ro: Marcheaza ca achizitionat

source: Restore
ro: Restabileste

source: Restore all products
ro: Restabileste toate produsele

source: Pending
ro: In asteptare

source: Bought
ro: Cumparate

source: Rename item
ro: Redenumeste produs

source: Delete item
ro: Stergere produs

# addNewShoppingListItem
source: Add new shopping list
ro: Adauga lista noua

# addNewShoppingItemSnackbarSuccessMessage
source: Shopping list item was added to the list
ro: Lista a fost adaugata

# emptyShoppingListMessage
source: There is no shopping list defined. Try adding one using the + button
ro: Nu aveti nici o lista de cumparaturi. Pentru a adauga o lista folosind butonul +

# emptyShoppingProductMessage
source: Looks like the list is empty. Try adding new products using search
ro: Nu exista produse. Adaugati un produs folosind butonul de cautare

# emptyBoughtShoppingProductMessage
source: There are no bought items. Swipe right on an active item to mark it as bought
ro: Nu exista produse cumparate. Glisati spre dreata pe un produs in asteptare pentru a-l muta in lista de cumparate

# renameShoppingListItemMessage
source: Shopping list item was renamed
ro: Lista a fost redenumita

# removeShoppingListItemMessage
source: Shopping list item was removed
ro: Lista a fost stearsa

# removeItemConfirmation
source: Are you sure you want to remove this item?
ro: Sunteti sigur ca vreti sa stergeti produsul?
